# FacetingUtils Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FacetingUtils Methods
FacetingUtils Class See Also
---
The FacetingUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConvertTrianglesToQuads | Replaces pairs of adjacent, coplanar triangles by quadrilaterals. |

# See Also
FacetingUtils Class
Autodesk.Revit.DB Namespace